Data/Section 5/5.2/Client/VM1_Instance1/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       43366 ops,     366 (avg:     481) ops/sec, 1.30MB/sec (avg: 1.71MB/sec),  5.42 (avg:  4.14) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         240.92          ---          ---      4.15200       250.18
Gets         240.92      1445.51         0.00      4.12100      1504.02
Waits          0.00          ---          ---      0.00000          ---
Totals       481.84      1445.51         0.00      4.13600      1754.21


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.400         0.05
SET       1.500         0.42
SET       1.600         1.65
SET       1.700         3.92
SET       1.800         7.26
SET       1.900        11.40
SET       2.000        15.76
SET       2.100        20.22
SET       2.200        24.41
SET       2.300        28.58
SET       2.400        32.07
SET       2.500        35.06
SET       2.600        37.83
SET       2.700        40.40
SET       2.800        42.64
SET       2.900        44.70
SET       3.000        46.54
SET       3.100        48.19
SET       3.200        49.83
SET       3.300        51.20
SET       3.400        52.34
SET       3.500        53.36
SET       3.600        54.28
SET       3.700        55.27
SET       3.800        56.18
SET       3.900        57.15
SET       4.000        58.06
SET       4.100        59.00
SET       4.200        59.89
SET       4.300        60.86
SET       4.400        61.92
SET       4.500        63.09
SET       4.600        64.19
SET       4.700        65.53
SET       4.800        66.84
SET       4.900        68.16
SET       5.000        69.53
SET       5.100        70.85
SET       5.200        72.15
SET       5.300        73.56
SET       5.400        74.81
SET       5.500        76.12
SET       5.600        77.57
SET       5.700        78.79
SET       5.800        79.96
SET       5.900        81.14
SET       6.000        82.28
SET       6.100        83.40
SET       6.200        84.46
SET       6.300        85.33
SET       6.400        86.25
SET       6.500        86.98
SET       6.600        87.68
SET       6.700        88.29
SET       6.800        88.85
SET       6.900        89.47
SET       7.000        90.02
SET       7.100        90.42
SET       7.200        90.93
SET       7.300        91.29
SET       7.400        91.65
SET       7.500        91.94
SET       7.600        92.28
SET       7.700        92.64
SET       7.800        93.06
SET       7.900        93.46
SET       8.000        93.76
SET       8.100        94.01
SET       8.200        94.27
SET       8.300        94.54
SET       8.400        94.75
SET       8.500        95.01
SET       8.600        95.21
SET       8.700        95.39
SET       8.800        95.55
SET       8.900        95.70
SET       9.000        95.94
SET       9.100        96.07
SET       9.200        96.24
SET       9.300        96.45
SET       9.400        96.61
SET       9.500        96.73
SET       9.600        96.92
SET       9.700        97.03
SET       9.800        97.18
SET       9.900        97.30
SET      10.000        97.94
SET      11.000        98.47
SET      12.000        98.81
SET      13.000        99.07
SET      14.000        99.28
SET      15.000        99.41
SET      16.000        99.53
SET      17.000        99.60
SET      18.000        99.69
SET      19.000        99.74
SET      20.000        99.77
SET      21.000        99.82
SET      22.000        99.87
SET      23.000        99.87
SET      24.000        99.88
SET      25.000        99.89
SET      26.000        99.91
SET      27.000        99.92
SET      28.000        99.93
SET      29.000        99.95
SET      30.000        99.95
SET      31.000        99.96
SET      32.000        99.96
SET      33.000        99.97
SET      35.000        99.98
SET      37.000        99.98
SET      38.000        99.99
SET      40.000       100.00
SET      70.000       100.00
---
GET       1.500         0.00
GET       1.600         0.08
GET       1.700         0.64
GET       1.800         2.05
GET       1.900         4.70
GET       2.000         8.92
GET       2.100        14.08
GET       2.200        19.40
GET       2.300        24.65
GET       2.400        29.45
GET       2.500        33.83
GET       2.600        37.45
GET       2.700        40.59
GET       2.800        43.49
GET       2.900        45.93
GET       3.000        48.21
GET       3.100        50.10
GET       3.200        51.79
GET       3.300        53.16
GET       3.400        54.38
GET       3.500        55.51
GET       3.600        56.64
GET       3.700        57.63
GET       3.800        58.57
GET       3.900        59.42
GET       4.000        60.24
GET       4.100        61.14
GET       4.200        61.91
GET       4.300        62.77
GET       4.400        63.59
GET       4.500        64.45
GET       4.600        65.36
GET       4.700        66.35
GET       4.800        67.32
GET       4.900        68.45
GET       5.000        69.70
GET       5.100        70.80
GET       5.200        72.02
GET       5.300        73.21
GET       5.400        74.62
GET       5.500        76.08
GET       5.600        77.39
GET       5.700        78.75
GET       5.800        80.07
GET       5.900        81.34
GET       6.000        82.65
GET       6.100        83.95
GET       6.200        85.01
GET       6.300        86.13
GET       6.400        87.15
GET       6.500        88.12
GET       6.600        88.88
GET       6.700        89.56
GET       6.800        90.23
GET       6.900        90.83
GET       7.000        91.42
GET       7.100        91.96
GET       7.200        92.35
GET       7.300        92.76
GET       7.400        93.08
GET       7.500        93.42
GET       7.600        93.80
GET       7.700        94.16
GET       7.800        94.44
GET       7.900        94.69
GET       8.000        94.96
GET       8.100        95.24
GET       8.200        95.48
GET       8.300        95.69
GET       8.400        95.91
GET       8.500        96.08
GET       8.600        96.24
GET       8.700        96.41
GET       8.800        96.55
GET       8.900        96.73
GET       9.000        96.84
GET       9.100        96.96
GET       9.200        97.04
GET       9.300        97.18
GET       9.400        97.31
GET       9.500        97.43
GET       9.600        97.55
GET       9.700        97.63
GET       9.800        97.71
GET       9.900        97.82
GET      10.000        98.32
GET      11.000        98.75
GET      12.000        99.08
GET      13.000        99.23
GET      14.000        99.37
GET      15.000        99.46
GET      16.000        99.55
GET      17.000        99.59
GET      18.000        99.63
GET      19.000        99.67
GET      20.000        99.70
GET      21.000        99.74
GET      22.000        99.77
GET      23.000        99.81
GET      24.000        99.83
GET      25.000        99.84
GET      26.000        99.86
GET      27.000        99.88
GET      28.000        99.89
GET      29.000        99.90
GET      30.000        99.92
GET      32.000        99.93
GET      33.000        99.94
GET      34.000        99.94
GET      37.000        99.95
GET      38.000        99.95
GET      39.000        99.97
GET      41.000        99.97
GET      56.000        99.98
GET      58.000        99.98
GET      67.000        99.99
GET      70.000       100.00
GET      87.000       100.00
---